# Werkcollege-opdrachten Week 1.3

## Dependencies importeren

Kopieer in het codeblok hieronder van het vorige practicum de import-code voor de dependencies die het vaakst worden gebruikt om data in te lezen. Geef er ook de gebruikelijke aliassen aan.<br>
Zet eventuele warnings uit.

In [37]:
import warnings
import sqlite3
import pandas as pd
warnings.simplefilter('ignore')

Zet het bestand go_sales_train.sqlite in een makkelijk te vinden map

## Databasetabellen inlezen

Kopieer in het codeblok hieronder van het vorige practicum de code om een connectie met het bestand go_sales_train.sqlite te maken.

In [38]:
conn = sqlite3.connect("../Data/go_sales_train.sqlite")
sales_conn = conn.cursor()

Lees van de ingelezen go_sales_train-database te volgende tabellen in met behulp van "SELECT * FROM *tabel*".
- product
- product_type
- product_line
- sales_staff
- sales_branch
- retailer_site
- country
- order_header
- order_details
- returned_item
- return_reason

In [39]:
product = pd.read_sql_query("SELECT * FROM product", conn)
product_type = pd.read_sql_query("SELECT * FROM product_type", conn)
product_line = pd.read_sql_query("SELECT * FROM product_line", conn)
sales_staff = pd.read_sql_query("SELECT * FROM sales_staff", conn)
sales_branch = pd.read_sql_query("SELECT * FROM sales_branch", conn)
retailer_site = pd.read_sql_query("SELECT * FROM retailer_site", conn)
country = pd.read_sql_query("SELECT * FROM country", conn)
order_header = pd.read_sql_query("SELECT * FROM order_header", conn)
order_details = pd.read_sql_query("SELECT * FROM order_details", conn)
returned_item = pd.read_sql_query("SELECT * FROM returned_item", conn)
return_reason = pd.read_sql_query("SELECT * FROM return_reason", conn)

Krijg je een "no such table" error? Dan heb je misschien met .connect() per ongeluk een leeg  databasebestand (.sqlite) aangemaakt. <u>Let op:</u> lees eventueel de informatie uit het Notebook van werkcollege 1.1b nog eens goed door.

Als je tijdens onderstaande opdrachten uit het oog verliest welke tabellen er allemaal zijn, kan je deze Pythoncode uitvoeren:

In [40]:
sql_query = "SELECT name FROM sqlite_master WHERE type='table';"
#Vul dit codeblok verder in
pd.read_sql(sql_query, conn)
#Op de puntjes hoort de connectie naar go_sales_train óf go_staff_train óf go_crm_train te staan.

             name
0         country
1   order_details
2    order_header
3    order_method
4         product
5    product_line
6    product_type
7   retailer_site
8   return_reason
9   returned_item
10   sales_branch
11    sales_staff

erachter

Let op! Voor alle onderstaande opdrachten mag je <u>alleen Python</u> gebruiken, <u>geen SQL!</u>

## Selecties op één tabel zonder functies

Geef een overzicht met daarin de producten en hun productiekosten waarvan de productiekosten lager dan 100 dollar en hoger dan 50 dollar ligt. (2 kolommen, 23 rijen)

In [41]:
producteis = (product['PRODUCTION_COST'] > 50) & (product['PRODUCTION_COST'] < 100)

product.loc[producteis, ("PRODUCT_NAME", 'PRODUCTION_COST')]

                        PRODUCT_NAME  PRODUCTION_COST
5          TrailChef Deluxe Cook Set            85.11
7             TrailChef Double Flame            75.00
16                   Hibernator Lite            60.00
17                        Hibernator            86.00
19   Hibernator Self - Inflating Mat            78.55
22               Hibernator Camp Cot            65.33
23      Canyon Mule Climber Backpack            62.50
45           Granite Climbing Helmet            52.86
47             Husky Harness Extreme            55.00
57                    Granite Hammer            57.13
68                         Polar Ice            73.33
69                      Polar Sports            80.00
70                        Polar Wave            60.00
71                     Polar Extreme            72.50
74                      Edge Extreme            80.00
77                         Seeker 35            79.19
78                         Seeker 50            92.58
79                    Seeker Extreme            94.12
82                    Glacier Deluxe            56.25
83                       Glacier GPS            78.55
109                Blue Steel Putter            60.00
110            Blue Steel Max Putter            81.80
113              Course Pro Golf Bag            80.00

Geef een overzicht met daarin de producten en hun marge waarvan de marge lager dan 20 % of hoger dan 60 % ligt. (2 kolommen, 7 rijen)

In [42]:
producteise = (product["MARGIN"] < 0.2) | (product["MARGIN"] > 0.6)
product.loc[(producteise), ("PRODUCT_NAME", 'MARGIN')]

                    PRODUCT_NAME  MARGIN
20                Hibernator Pad    0.17
23  Canyon Mule Climber Backpack    0.17
85             BugShield Natural    0.67
86               BugShield Spray    0.67
87         BugShield Lotion Lite    0.70
88              BugShield Lotion    0.63
89             BugShield Extreme    0.63

Geef een overzicht met daarin de landen waar met francs wordt betaald. Sorteer de uitkomst op land.  (1 kolom, 3 rijen)

In [43]:
currencyeis = (country['CURRENCY_NAME'] == 'francs')

country.loc[currencyeis, ("COUNTRY")]

0          France
7     Switzerland
15        Belgium
Name: COUNTRY, dtype: object

Geef een overzicht met daarin de verschillende introductiedatums waarop producten met meer dan 50% marge worden geïntroduceerd (1 kolom, 7 rijen)

In [44]:
producteis = (product["MARGIN"] > 0.5)
product.loc[(producteis), ("INTRODUCTION_DATE")].drop_duplicates()

66     2000-10-26
85     1995-02-15
101    2003-12-10
103    2003-12-18
104    2003-12-27
106    2004-01-13
110    2003-12-15
Name: INTRODUCTION_DATE, dtype: object

Geef een overzicht met daarin het eerste adres en de stad van verkoopafdelingen waarvan zowel het tweede adres als de regio bekend is (2 kolommen, 7 rijen)

In [45]:
eis = (sales_branch['ADDRESS2'].notna()) & (sales_branch['REGION'].notna())
sales_branch.loc[eis, ["ADDRESS1", "CITY"]]

                            ADDRESS1              CITY
2                Singelgravenplein 4         Amsterdam
13  Prol. Paseo de la Reforma No. 51  Distrito Federal
14               202-2-3 Hyakunincho             Tokyo
15                     543-225 Asahi        Osaka City
16                  2315 Queen's Ave         Melbourne
18             Avenida Paulista, 333         São Paulo
24                    3 Albany Court        Birmingham

Geef een overzicht met daarin de landen waar met dollars (dollars of new dollar) wordt betaald. Sorteer de uitkomst op land. (1 kolom, 4 rijen)

In [46]:
eis = (country['CURRENCY_NAME'] == 'dollars') | (country['CURRENCY_NAME'] == 'new dollar')
country.loc[eis, ("COUNTRY")]

2     United States
3            Canada
11           Taiwan
14        Australia
Name: COUNTRY, dtype: object

Geef een overzicht met daarin beide adressen en de stad van vestigingen van klanten waarvan de postcode begint met een ‘D’ (van duitsland). Filter op vestigingen die een tweede adres hebben. (3 kolommen, 2 rijen)

In [47]:
eis = (retailer_site['POSTAL_ZONE'].str[0] == "D") & (retailer_site['ADDRESS2'].notna())

retailer_site.loc[eis, ["ADDRESS1", "ADDRESS2", "CITY"]]

            ADDRESS1       ADDRESS2       CITY
31  Röntgenstraße 90  3. Tür rechts  Frankfurt
59   Grubesallee 141       4. Stock    Hamburg

## Selecties op één tabel met functies

Geef het totaal aantal producten dat is teruggebracht (1 waarde)

In [48]:
returned_item.loc[:, ["RETURN_QUANTITY"]].sum()

RETURN_QUANTITY    11908
dtype: int64

Geef het aantal regio’s waarin verkoopafdelingen gevestigd zijn. (1 waarde)

In [49]:
sales_branch.loc[:, ["REGION"]].drop_duplicates().shape[0]

16

Maak 3 variabelen:
- Een met de laagste
- Een met de hoogste
- Een met de gemiddelde (afgerond op 2 decimalen)

marge van producten (3 kolommen, 1 rij)

In [50]:
laagste = product["MARGIN"].min()
hoogste = product["MARGIN"].max()
gemiddelde = product["MARGIN"].mean()

resultaat = pd.DataFrame({
    "Laagste": [laagste],
    "Hoogste": [hoogste],
    "Gemiddelde": [gemiddelde]
})
resultaat.round(2)

   Laagste  Hoogste  Gemiddelde
0     0.17      0.7         0.4

Geef het aantal vestigingen van klanten waarvan het 2e adres niet bekend is (1 waarde)

In [51]:
eis = (retailer_site["ADDRESS2"].isna())
retailer_site.loc[eis, ["RETAILER_SITE_CODE"]].count()

RETAILER_SITE_CODE    286
dtype: int64

Geef de gemiddelde kostprijs van de verkochte producten waarop korting (unit_sale_price < unit_price) is verleend (1 waarde)

In [52]:
korting = order_details['UNIT_SALE_PRICE'] < order_details['UNIT_PRICE']

order_details.loc[korting, ["UNIT_COST"]].mean()

UNIT_COST    127.340879
dtype: float64

Geef een overzicht met daarin het aantal medewerkers per medewerkersfunctie (2 kolommen, 7 rijen)

In [53]:
sales_staff.groupby("POSITION_EN").size()

POSITION_EN
Branch Manager                  19
District Manager                 4
General Manager                  1
Level 1 Sales Representative    13
Level 2 Sales Representative    39
Level 3 Sales Representative    24
Regional Manager                 2
dtype: int64

Geef een overzicht met daarin per telefoonnummer het aantal medewerkers dat op dat telefoonnummer bereikbaar is. Toon alleen de telefoonnummer waarop meer dan 4 medewerkers bereikbaar zijn. (2 kolommen, 10 rijen)

In [54]:
sales_staff_2 = sales_staff["WORK_PHONE"].value_counts()
resultaat = sales_staff_2[sales_staff_2 > 4]
resultaat

WORK_PHONE
1 (305) 557-4810       6
1 (617) 268-6754       6
+31 (0)20 692 93 94    5
1 (403) 232-5986       5
+33 1 68 94 52 20      5
1 (206) 292-0012       5
1 (416) 493-5595       5
1 (310) 281-5722       5
+(61) 03 2982  4242    5
+(44) 121 3505267      5
Name: count, dtype: int64

## Selecties op meerdere tabellen zonder functies

Geef een overzicht met daarin het eerste adres en de stad van vestigingen van klanten uit ‘Netherlands’ (2 kolommen, 20 rijen)

In [55]:
land = pd.merge(country, retailer_site, left_on="COUNTRY_CODE", how="inner", right_on="COUNTRY_CODE")
eis = land["COUNTRY"] == "Netherlands"
land.loc[eis, ["ADDRESS1", "CITY"]]

                      ADDRESS1          CITY
215                   Beets 36         Beets
216               Perestraat 1      Deventer
217  Laan van Meerdervoort 966      Den Haag
218             Kalfjeslaan 47    Amstelveen
219               Startbaan 11    Amstelveen
220      Noorderspoorsingel 28     Groningen
221              Hogehilweg 13     Amsterdam
222             Spoorstraat 43    Varsseveld
223             Westhavenweg 8     Amsterdam
224              Westzeedijk 4        Muiden
225            Gooiergracht 91         Laren
226            Hoofdstraat 150   Pieterburen
227                Olde Diek 2         Laren
228     Amsterdamsestraatweg 8      Maarssen
229        Krayenhoffstraat 11     Amsterdam
230         Overschiestraat 19     Amsterdam
231              Havenbuurt 12        Marken
232               Duivendaal 1    Wageningen
233              Voorstraat 37  Nieuweschans
234         Stadhouderslaan 18     Rotterdam

Geef een overzicht met daarin de productnamen die tot het producttype ‘Eyewear’ behoren. (1 kolom, 5 rijen)

In [56]:
productje = pd.merge(product_type, product, on="PRODUCT_TYPE_CODE", how="inner")
eis = (productje["PRODUCT_TYPE_EN"] == "Eyewear")
productje.loc[eis, ["PRODUCT_NAME"]]

     PRODUCT_NAME
67      Polar Sun
68      Polar Ice
69   Polar Sports
70     Polar Wave
71  Polar Extreme

Geef een overzicht met daarin alle unieke eerste adressen van klantvestigingen en de voornaam en achternaam van de verkopers die ‘Branch Manager’ zijn en aan deze vestigingen hebben verkocht (3 kolommen, 1 rij)

In [57]:
verkochten = pd.merge(sales_staff, order_header, on="SALES_STAFF_CODE")
goede = pd.merge(verkochten, retailer_site, on="RETAILER_SITE_CODE")
eis = (goede["POSITION_EN"] == "Branch Manager")
goede.loc[eis, ["ADDRESS1", "FIRST_NAME", "LAST_NAME"]].drop_duplicates()

                  ADDRESS1 FIRST_NAME LAST_NAME
3727  Alameda Santos, 9876     Bayard     Lopes

Geef een overzicht met daarin van de verkopers hun functie en indien zij iets hebben verkocht de datum waarop de verkoop heeft plaatsgevonden. Laat alleen de verschillende namen van de posities zien van de verkopers die het woord ‘Manager’ in hun positienaam hebben staan. (2 kolommen, 7 rijen)

In [58]:
verkochten = pd.merge(order_header, sales_staff, left_on="SALES_STAFF_CODE", how="right", right_on="SALES_STAFF_CODE")

eis = (verkochten["POSITION_EN"].str.contains("Manager"))
verkochten.loc[eis, ["POSITION_EN", "ORDER_DATE"]].drop_duplicates()

           POSITION_EN  ORDER_DATE
0       Branch Manager         NaN
320   Regional Manager         NaN
648   District Manager         NaN
3748    Branch Manager  2024-09-09
3749    Branch Manager  2024-03-13
3750    Branch Manager  2024-01-09
4186   General Manager         NaN

Geef een overzicht met daarin de verschillende namen van producten en bijbehorende namen van producttypen van de producten waarvoor ooit meer dan 750 stuks tegelijk verkocht zijn. (2 kolommen, 9 rijen)

In [59]:
productnaam = pd.merge(product, order_details, on="PRODUCT_NUMBER", how="inner")
productcode = pd.merge(productnaam, product_type, on="PRODUCT_TYPE_CODE", how="inner")
eis = (productcode["QUANTITY"] > 750)
productcode.loc[eis, ["PRODUCT_NAME", "PRODUCT_TYPE_EN"]].drop_duplicates()

                PRODUCT_NAME    PRODUCT_TYPE_EN
5427                Star Peg              Tents
11452              Firefly 2           Lanterns
28608        BugShield Spray  Insect Repellents
28892  BugShield Lotion Lite  Insect Repellents
29430       BugShield Lotion  Insect Repellents
29442      BugShield Extreme  Insect Repellents
30741         Sun Shelter 15          Sunscreen
31164         Sun Shelter 30          Sunscreen
31775             Sun Shield          Sunscreen

Geef een overzicht met daarin de productnamen waarvan ooit meer dan 40% korting is verleend. De formule voor korting is: (unit_price - unit_sale_price) / unit_price (1 kolom, 8 rijen)

In [60]:
productnaam = pd.merge(order_details, product, on="PRODUCT_NUMBER", how="inner")
eis = ((productnaam["UNIT_PRICE"] - productnaam["UNIT_SALE_PRICE"]) / productnaam["UNIT_PRICE"]) > 0.4
productnaam.loc[eis, ["PRODUCT_NAME"]].drop_duplicates()

                      PRODUCT_NAME
506              BugShield Natural
511                BugShield Spray
650   Hailstorm Titanium Woods Set
2797         BugShield Lotion Lite
2836                Sun Shelter 30
3751             BugShield Extreme
5074                Sun Shelter 15
6930              BugShield Lotion

Geef een overzicht met daarin de retourreden van producten waarvan ooit meer dan 90% van de aangeschafte hoeveelheid is teruggebracht (return_quantity/quantity). (1 kolom, 3 rijen)

In [61]:
returnproduct = pd.merge(returned_item, order_details, on="ORDER_DETAIL_CODE", how="inner")
returnreden = pd.merge(returnproduct, return_reason, on="RETURN_REASON_CODE", how="inner")
eis = (returnreden["RETURN_QUANTITY"] / returnreden["QUANTITY"]) > 0.90
returnreden.loc[eis, ["RETURN_DESCRIPTION_EN"]].drop_duplicates()

    RETURN_DESCRIPTION_EN
0  Unsatisfactory product
2   Wrong product shipped
3   Wrong product ordered

## Selecties op meerdere tabellen met functies

Geef een overzicht met daarin per producttype het aantal producten die tot dat producttype behoren. (2 kolommen, 21 rijen)

In [62]:
producttype = product_type.merge(product, on="PRODUCT_TYPE_CODE", how="inner")
productaantal = producttype.groupby("PRODUCT_TYPE_EN").size().reset_index(name="Aantal producten")
productaantal

         PRODUCT_TYPE_EN  Aantal producten
0             Binoculars                 4
1   Climbing Accessories                 7
2           Cooking Gear                10
3                Eyewear                 5
4              First Aid                 5
5       Golf Accessories                 4
6      Insect Repellents                 5
7                  Irons                 4
8                 Knives                 5
9               Lanterns                12
10            Navigation                 4
11                 Packs                 6
12               Putters                 3
13                  Rope                 4
14                Safety                 4
15         Sleeping Bags                 7
16             Sunscreen                 5
17                 Tents                 6
18                 Tools                 6
19               Watches                 5
20                 Woods                 4

Geef een overzicht met daarin per land het aantal vestigingen van klanten die zich in dat land bevinden. (2 kolommen, 21 rijen)

In [63]:
klant = pd.merge(retailer_site, country, on="COUNTRY_CODE", how="inner")
klantperland = klant.groupby("COUNTRY").size().reset_index(name="Aantal vestigingen")
klantperland

           COUNTRY  Aantal vestigingen
0        Australia                  10
1          Austria                  10
2          Belgium                  10
3           Brazil                   1
4           Canada                  31
5            China                  10
6          Denmark                   6
7          Finland                   5
8           France                  29
9          Germany                  32
10           Italy                  12
11           Japan                  25
12           Korea                  10
13          Mexico                  10
14     Netherlands                  20
15           Spain                   9
16          Sweden                  12
17     Switzerland                  13
18          Taiwan                  10
19  United Kingdom                  25
20   United States                 101

Geef een overzicht met daarin van de producten behorend tot het producttype ‘Cooking Gear’ per productnaam de totaal verkochte hoeveelheid en de gemiddelde verkoopprijs. Sorteer de uitkomst op totaal verkochte hoeveelheid. (4 kolommen, 10 rijen)

In [64]:
productje = product_type.merge(product, on="PRODUCT_TYPE_CODE", how="inner")
productjes = productje.merge(order_details, on="PRODUCT_NUMBER", how="inner")
producttype = productjes["PRODUCT_TYPE_EN"] == "Cooking Gear"
producttypeje = productjes.loc[producttype]
producttypejes = producttypeje.groupby("PRODUCT_NAME").agg(Aantal_verkocht=("QUANTITY", "sum"), Gemiddelde_prijs=("UNIT_PRICE", "mean"))
gesorteerd = producttypejes.sort_values("Aantal_verkocht", ascending=True)
gesorteerd

                           Aantal_verkocht  Gemiddelde_prijs
PRODUCT_NAME
TrailChef Deluxe Cook Set             3110        124.178425
TrailChef Single Flame                8504         65.289805
TrailChef Kettle                      8826         12.421525
TrailChef Cook Set                   10878         52.990028
TrailChef Double Flame               12476        137.535088
TrailChef Utensils                   13776         17.836475
TrailChef Kitchen Kit                22206         22.849400
TrailChef Canteen                    26544         12.210194
TrailChef Cup                        27418          7.157326
TrailChef Water Bag                  36738          6.200716

Geef een overzicht met daarin per land de naam van het land, de naam van de stad waar de verkoopafdeling is gevestigd (noem de kolomnaam in het overzicht ‘verkoper’) en het aantal steden waar zich klanten bevinden in dat land (noem de kolomnaam in het overzicht ‘klanten’) (3 kolommen, 29 rijen)

In [65]:
land = country.merge(sales_branch, on="COUNTRY_CODE", how="inner").rename({"CITY": "VERKOPER"}, axis=1)
klant = country.merge(retailer_site, on="COUNTRY_CODE", how="inner")
eind = klant.groupby("COUNTRY").agg(Aantal_klanten=("RETAILER_SITE_CODE", "nunique")).reset_index()
andereeind = land[['COUNTRY', 'VERKOPER']].drop_duplicates()
allerlaatste = pd.merge(andereeind, eind, on="COUNTRY", how="left")
allerlaatste

           COUNTRY          VERKOPER  Aantal_klanten
0           France             Paris              29
1           France              Lyon              29
2          Germany           Hamburg              32
3          Germany           München              32
4    United States            Boston             101
5    United States           Seattle             101
6    United States       Los Angeles             101
7    United States             Miami             101
8           Canada           Calgary              31
9           Canada           Toronto              31
10         Austria              Wien              10
11           Italy            Milano              12
12     Netherlands         Amsterdam              20
13     Switzerland            Zürich              13
14  United Kingdom            London              25
15  United Kingdom        Birmingham              25
16          Sweden             Kista              12
17           Japan             Tokyo              25
18           Japan        Osaka City              25
19          Taiwan         San Chung              10
20           Korea             Seoul              10
21           China          Shanghai              10
22       Australia         Melbourne              10
23         Belgium          Heverlee              10
24           Spain            Bilbao               9
25          Mexico  Distrito Federal              10
26          Brazil         São Paulo               1
27         Finland            Kuopio               5

## Pythonvertalingen van SUBSELECT en UNION met o.a. for-loops

Geef een overzicht met daarin de voornaam en de achternaam van de medewerkers die nog nooit wat hebben verkocht (2 kolommen, 25 rijen)

In [66]:
medewerkers = sales_staff.merge(order_header, on="SALES_STAFF_CODE", how="left")
nietgekocht = medewerkers["ORDER_NUMBER"].isna()
medewerkers.loc[nietgekocht, ["FIRST_NAME", "LAST_NAME"]]

     FIRST_NAME      LAST_NAME
0         Denis           Pagé
320        Else         Mörike
321       Frank          Fuchs
647       Fritz         Hirsch
648        Jörg          Kunze
728       Maria      Iacobucci
946        Kick        Kalkman
1309      Karin      Bergström
1395      Sally          White
1421      Frank        Bretton
1422    Georges  Saint-Germain
1719       Alex      Rodriguez
2088   Samantha          Floyd
2392      Julie          Olsen
2530      Corey         Wright
2873    Estelle        Johnson
2874       Greg        Belding
2999      Julie        Béchard
3157      Lucía          Reyna
3401     Kazumi        Uragome
3559      Alice         Walter
4185     Walter         Taylor
4186   Penelope        Tamrine
4349      Polly         Linton
4590      Gracy        Gellens

Geef een overzicht met daarin het aantal producten waarvan de marge lager is dan de gemiddelde marge van alle producten samen. Geef in het overzicht tevens aan wat de gemiddelde marge is van dit aantal producten waarvan de marge lager dan de gemiddelde marge van alle producten samen is. (1 kolom, 2 rijen)

In [67]:
gemiddelde = product["MARGIN"].mean()
lager = product["MARGIN"] < gemiddelde
rijen = product.loc[lager, ["MARGIN"]]
daarvangemiddelde = rijen["MARGIN"].mean()
alleproducten = rijen["MARGIN"].count()
daarvangemiddelde
alleproducten
laatste = pd.DataFrame({"": [daarvangemiddelde, alleproducten]}, index=["Gemiddelde margin", "Gemiddeld aantal producten"])
laatste

Gemiddelde margin            0.292203
Gemiddeld aantal producten  59.000000

Geef een overzicht met daarin de namen van de producten die voor meer dan 500 (verkoopprijs) zijn verkocht maar nooit zijn teruggebracht. (1 kolom, 13 rijen)

In [68]:
orderzondernaam = order_details.merge(returned_item, on="ORDER_DETAIL_CODE", how="left")
order = orderzondernaam.merge(product, on="PRODUCT_NUMBER", how="inner")
nietterug = (order["RETURN_CODE"].isna()) & (order["UNIT_PRICE"] > 500)
order.loc[nietterug, ["PRODUCT_NAME"]].drop_duplicates()

                           PRODUCT_NAME
88                            Star Dome
95                         Star Gazer 2
103                        Star Gazer 3
112                        Star Gazer 6
616               Hailstorm Steel Irons
625            Hailstorm Titanium Irons
634          Lady Hailstorm Steel Irons
641       Lady Hailstorm Titanium Irons
647        Hailstorm Titanium Woods Set
657           Hailstorm Steel Woods Set
665   Lady Hailstorm Titanium Woods Set
674      Lady Hailstorm Steel Woods Set
1104                     Husky Rope 200

Geef een overzicht met daarin per (achternaam van) medewerker of hij/zij manager is of niet, door deze informatie toe te voegen als extra 'Ja/Nee'-kolom.<br>
Hint: gebruik een for-loop waarin je o.a. bepaalt of het woord 'Manager' in de functie (position_en) staat. (2 kolommen, 102 rijen).

In [69]:
medewerkers = sales_staff[["LAST_NAME", "POSITION_EN"]]
for index, medewerker in medewerkers.iterrows():
    Manager = medewerkers.at[index, "POSITION_EN"]
    if "Manager" in Manager:
        medewerkers.at[index, "MANAGER"] = "Ja"
    else:
        medewerkers.at[index, "MANAGER"] = "Nee"
medewerkers = medewerkers.drop("POSITION_EN", axis=1)
medewerkers

     LAST_NAME MANAGER
0         Pagé      Ja
1       Michel     Nee
2     Clermont     Nee
3       Jauvin     Nee
4    Wiesinger     Nee
..         ...     ...
97    Laermans     Nee
98     De Crée     Nee
99     Lattrez     Nee
100  Seefelder     Nee
101     Grüner     Nee

[102 rows x 2 columns]

Met de onderstaande code laat je Python het huidige jaar uitrekenen.

In [70]:
from datetime import date
date.today().year

2025

Met de onderstaande code selecteer je op een bepaald jaartal uit een datum.

In [71]:
from datetime import datetime

date_str = '16-8-2013'
date_format = '%d-%m-%Y'
date_obj = datetime.strptime(date_str, date_format)

date_obj.year

2013

Geef met behulp van bovenstaande hulpcode een overzicht met daarin op basis van het aantal jaar dat iemand in dienst is of een medewerker ‘kort in dienst’ (minder dan 25 jaar in dienst) of een ‘lang in dienst’ (groter gelijk dan 12 jaar in dienst) is. Geef daarbij per medewerker in een aparte kolom zowel ‘kort in dienst’ als ‘lang in dienst’ aan. Gebruik (wederom) een for-loop.<br>
(2 kolommen, 102 rijen)

In [72]:
medewerkers = sales_staff[["LAST_NAME", "DATE_HIRED"]]
ditjaar = date.today().year
medewerkers
for index, medewerker in medewerkers.iterrows():
    date_str = medewerker["DATE_HIRED"]
    date_format = '%Y-%m-%d'
    date_obj = datetime.strptime(date_str, date_format)
    if (ditjaar - date_obj.year) >= 25:
        medewerker["DATE_HIRED"] = "Lang in dienst"
    else:
        medewerker["DATE_HIRED"] = "Kort in dienst"
medewerkers

     LAST_NAME      DATE_HIRED
0         Pagé  Lang in dienst
1       Michel  Lang in dienst
2     Clermont  Lang in dienst
3       Jauvin  Lang in dienst
4    Wiesinger  Lang in dienst
..         ...             ...
97    Laermans  Lang in dienst
98     De Crée  Lang in dienst
99     Lattrez  Lang in dienst
100  Seefelder  Lang in dienst
101     Grüner  Lang in dienst

[102 rows x 2 columns]

## Van Jupyter Notebook naar Pythonproject

1. Richt de map waarin jullie tot nu toe hebben gewerkt in volgens de mappenstructuur uit de slides.
2. Maak van de ontstane mappenstructuur een Pythonproject dat uitvoerbaar is vanuit de terminal. Maak daarin een .py-bestand dat minstens 5 antwoorden uit dit notebook (in de vorm van een DataFrame) exporteert naar Excelbestanden. Alle notebooks mogen als notebook blijven bestaan.
3. Zorg ervoor dat dit Pythonproject zijn eigen repo heeft op Github. Let op: je virtual environment moet <b><u>niet</u></b> meegaan naar Github.

Je mag tijdens dit proces je uit stap 1 ontstane mappenstructuur aanpassen, zolang je bij het beoordelingsmoment kan verantwoorden wat de motivatie hierachter is. De slides verplichten je dus nergens toe.